[Survived] BlockStatement
Desktop/Web Engineering/scripts/background.js:20:80
   document.body.style.backgroundImage = "none";
 } */
 
-document.getElementById("Kalorienrechnerhintergrund").onmouseover = function() {
-  document.getElementById("Kalorienrechnerhintergrundbild").style.opacity = "1";
-}
+document.getElementById("Kalorienrechnerhintergrund").onmouseover = function() {}
 
 document.getElementById("Kalorienrechnerhintergrund").onmouseout = function() {

[Survived] StringLiteral
Desktop/Web Engineering/scripts/background.js:21:77
 } */
 
 document.getElementById("Kalorienrechnerhintergrund").onmouseover = function() {
-  document.getElementById("Kalorienrechnerhintergrundbild").style.opacity = "1";
+  document.getElementById("Kalorienrechnerhintergrundbild").style.opacity = "";
 }
 

[Survived] BlockStatement
Desktop/Web Engineering/scripts/background.js:24:79
   document.getElementById("Kalorienrechnerhintergrundbild").style.opacity = "1";
 }
 
-document.getElementById("Kalorienrechnerhintergrund").onmouseout = function() {
-  document.getElementById("Kalorienrechnerhintergrundbild").style.opacity = "0";
-}
+document.getElementById("Kalorienrechnerhintergrund").onmouseout = function() {}
 
 

[Survived] BlockStatement
Desktop/Web Engineering/scripts/background.js:31:78
 
 
 
-document.getElementById("Wasserrechnerhintergrund").onmouseover = function() {
-  document.getElementById("Wasserrechnerhintergrundbild").style.opacity = "1";
-}
+document.getElementById("Wasserrechnerhintergrund").onmouseover = function() {}
 
 document.getElementById("Wasserrechnerhintergrund").onmouseout = function() {

[Survived] StringLiteral
Desktop/Web Engineering/scripts/background.js:32:75
 
 
 document.getElementById("Wasserrechnerhintergrund").onmouseover = function() {
-  document.getElementById("Wasserrechnerhintergrundbild").style.opacity = "1";
+  document.getElementById("Wasserrechnerhintergrundbild").style.opacity = "";
 }
 

[Survived] BlockStatement
Desktop/Web Engineering/scripts/background.js:35:77
   document.getElementById("Wasserrechnerhintergrundbild").style.opacity = "1";
 }
 
-document.getElementById("Wasserrechnerhintergrund").onmouseout = function() {
-  document.getElementById("Wasserrechnerhintergrundbild").style.opacity = "0";
-}
+document.getElementById("Wasserrechnerhintergrund").onmouseout = function() {}
