[Survived] StringLiteral
Desktop/Web Engineering/scripts/caloriecalc.js:16:46
 sel.addEventListener("input", function () {
 
 
-    const activity = document.getElementById("aktivitaetslevel")
+    const activity = document.getElementById("")
     const i = activity.selectedIndex
     const pal = String(activity.options[i].value)

[Survived] StringLiteral
Desktop/Web Engineering/scripts/caloriecalc.js:20:56
     const i = activity.selectedIndex
     const pal = String(activity.options[i].value)
 
-    document.getElementById("grundumsatz").innerHTML = ""
+    document.getElementById("grundumsatz").innerHTML = "Stryker was here!"
     document.getElementById("leistungsumsatz").innerHTML = ""
 

[Survived] StringLiteral
Desktop/Web Engineering/scripts/caloriecalc.js:20:29
     const i = activity.selectedIndex
     const pal = String(activity.options[i].value)
 
-    document.getElementById("grundumsatz").innerHTML = ""
+    document.getElementById("").innerHTML = ""
     document.getElementById("leistungsumsatz").innerHTML = ""
 

[Survived] StringLiteral
Desktop/Web Engineering/scripts/caloriecalc.js:21:60
     const pal = String(activity.options[i].value)
 
     document.getElementById("grundumsatz").innerHTML = ""
-    document.getElementById("leistungsumsatz").innerHTML = ""
+    document.getElementById("leistungsumsatz").innerHTML = "Stryker was here!"
 
     const gender = document.querySelector('input[name="geschlecht"]:checked').value

[Survived] StringLiteral
Desktop/Web Engineering/scripts/caloriecalc.js:23:43
     document.getElementById("grundumsatz").innerHTML = ""
     document.getElementById("leistungsumsatz").innerHTML = ""
 
-    const gender = document.querySelector('input[name="geschlecht"]:checked').value
+    const gender = document.querySelector("").value
     const weight = document.getElementById("gewicht").value
     const age = document.getElementById("alter").value

[Survived] BlockStatement
Desktop/Web Engineering/scripts/caloriecalc.js:31:9
     handleImage(activity, gender)
 
     let result = {}
-    try {
-        result = harris(weight, height, age, pal, gender)
-    } catch (err) {
+    try {} catch (err) {
         printError(err)
     }

[Survived] BlockStatement
Desktop/Web Engineering/scripts/caloriecalc.js:33:19
     let result = {}
     try {
         result = harris(weight, height, age, pal, gender)
-    } catch (err) {
-        printError(err)
-    }
+    } catch (err) {}
 
     if (wrongInput == false) {

[Survived] BooleanLiteral
Desktop/Web Engineering/scripts/caloriecalc.js:37:23
         printError(err)
     }
 
-    if (wrongInput == false) {
+    if (wrongInput == true) {
         printError("")
         document.getElementById("grundumsatz").innerHTML = result.grundumsatz + " kcal"

[Survived] BlockStatement
Desktop/Web Engineering/scripts/caloriecalc.js:37:30
         printError(err)
     }
 
-    if (wrongInput == false) {
-        printError("")
-        document.getElementById("grundumsatz").innerHTML = result.grundumsatz + " kcal"
-        document.getElementById("leistungsumsatz").innerHTML = result.leistungsumsatz + " kcal"
-    }
+    if (wrongInput == false) {}
 
 })

[Survived] ArithmeticOperator
Desktop/Web Engineering/scripts/caloriecalc.js:39:60
 
     if (wrongInput == false) {
         printError("")
-        document.getElementById("grundumsatz").innerHTML = result.grundumsatz + " kcal"
+        document.getElementById("grundumsatz").innerHTML = result.grundumsatz - " kcal"
         document.getElementById("leistungsumsatz").innerHTML = result.leistungsumsatz + " kcal"
     }

[Survived] ArithmeticOperator
Desktop/Web Engineering/scripts/caloriecalc.js:40:64
     if (wrongInput == false) {
         printError("")
         document.getElementById("grundumsatz").innerHTML = result.grundumsatz + " kcal"
-        document.getElementById("leistungsumsatz").innerHTML = result.leistungsumsatz + " kcal"
+        document.getElementById("leistungsumsatz").innerHTML = result.leistungsumsatz - " kcal"
     }
 
