[Survived] BooleanLiteral
Desktop/Web Engineering/scripts/checkInput.js:1:30
-let wrongInput = new Boolean(false)
+let wrongInput = new Boolean(true)
 
 function checkInput(weight,height,age) {

[Killed] BlockStatement
Desktop/Web Engineering/scripts/checkInput.js:3:40
 let wrongInput = new Boolean(false)
 
-function checkInput(weight,height,age) {
-
-
-    if (!weight || !height || !age) {
-        wrongInput = true
-        throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"
-    }
-    if (weight < 35 || weight > 999) {
-        wrongInput = true
-        throw "Bitte geben Sie ein Gewicht zwischen 35kg und 999kg ein"
-    }
-    if (age < 16 || age > 99) {
-        wrongInput = true
-        throw "Bitte geben Sie ein Alter zwischen 16 und 99 Jahren ein"
-    }
-    if (height < 140 || height > 300) {
-        wrongInput = true
-        throw "Bitte geben Sie eine Größe zwischen 140cm und 300cm ein"
-    }
-
-    else {
-        wrongInput = false
-    }
-
-}
+function checkInput(weight,height,age) {}
 
 

[Killed] BooleanLiteral
Desktop/Web Engineering/scripts/checkInput.js:6:31
 function checkInput(weight,height,age) {
 
 
-    if (!weight || !height || !age) {
+    if (!weight || !height || age) {
         wrongInput = true
         throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"

[Killed] BooleanLiteral
Desktop/Web Engineering/scripts/checkInput.js:6:9
 function checkInput(weight,height,age) {
 
 
-    if (!weight || !height || !age) {
+    if (weight || !height || !age) {
         wrongInput = true
         throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"

[Survived] BooleanLiteral
Desktop/Web Engineering/scripts/checkInput.js:7:22
 
 
     if (!weight || !height || !age) {
-        wrongInput = true
+        wrongInput = false
         throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"
     }

[Survived] StringLiteral
Desktop/Web Engineering/scripts/checkInput.js:8:15
 
     if (!weight || !height || !age) {
         wrongInput = true
-        throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"
+        throw ""
     }
     if (weight < 35 || weight > 999) {

[Killed] ConditionalExpression
Desktop/Web Engineering/scripts/checkInput.js:10:9
         wrongInput = true
         throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"
     }
-    if (weight < 35 || weight > 999) {
+    if (false) {
         wrongInput = true
         throw "Bitte geben Sie ein Gewicht zwischen 35kg und 999kg ein"

[Killed] ConditionalExpression
Desktop/Web Engineering/scripts/checkInput.js:10:9
         wrongInput = true
         throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"
     }
-    if (weight < 35 || weight > 999) {
+    if (false || weight > 999) {
         wrongInput = true
         throw "Bitte geben Sie ein Gewicht zwischen 35kg und 999kg ein"

[Survived] BooleanLiteral
Desktop/Web Engineering/scripts/checkInput.js:11:22
         throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"
     }
     if (weight < 35 || weight > 999) {
-        wrongInput = true
+        wrongInput = false
         throw "Bitte geben Sie ein Gewicht zwischen 35kg und 999kg ein"
     }

[Killed] BlockStatement
Desktop/Web Engineering/scripts/checkInput.js:14:31
         wrongInput = true
         throw "Bitte geben Sie ein Gewicht zwischen 35kg und 999kg ein"
     }
-    if (age < 16 || age > 99) {
-        wrongInput = true
-        throw "Bitte geben Sie ein Alter zwischen 16 und 99 Jahren ein"
-    }
+    if (age < 16 || age > 99) {}
     if (height < 140 || height > 300) {
         wrongInput = true

[Killed] EqualityOperator
Desktop/Web Engineering/scripts/checkInput.js:14:9
         wrongInput = true
         throw "Bitte geben Sie ein Gewicht zwischen 35kg und 999kg ein"
     }
-    if (age < 16 || age > 99) {
+    if (age >= 16 || age > 99) {
         wrongInput = true
         throw "Bitte geben Sie ein Alter zwischen 16 und 99 Jahren ein"

[Survived] BooleanLiteral
Desktop/Web Engineering/scripts/checkInput.js:15:22
         throw "Bitte geben Sie ein Gewicht zwischen 35kg und 999kg ein"
     }
     if (age < 16 || age > 99) {
-        wrongInput = true
+        wrongInput = false
         throw "Bitte geben Sie ein Alter zwischen 16 und 99 Jahren ein"
     }

[Killed] BlockStatement
Desktop/Web Engineering/scripts/checkInput.js:18:39
         wrongInput = true
         throw "Bitte geben Sie ein Alter zwischen 16 und 99 Jahren ein"
     }
-    if (height < 140 || height > 300) {
-        wrongInput = true
-        throw "Bitte geben Sie eine Größe zwischen 140cm und 300cm ein"
-    }
+    if (height < 140 || height > 300) {}
 
     else {

[Killed] ConditionalExpression
Desktop/Web Engineering/scripts/checkInput.js:18:9
         wrongInput = true
         throw "Bitte geben Sie ein Alter zwischen 16 und 99 Jahren ein"
     }
-    if (height < 140 || height > 300) {
+    if (false) {
         wrongInput = true
         throw "Bitte geben Sie eine Größe zwischen 140cm und 300cm ein"

[Survived] BooleanLiteral
Desktop/Web Engineering/scripts/checkInput.js:19:22
         throw "Bitte geben Sie ein Alter zwischen 16 und 99 Jahren ein"
     }
     if (height < 140 || height > 300) {
-        wrongInput = true
+        wrongInput = false
         throw "Bitte geben Sie eine Größe zwischen 140cm und 300cm ein"
     }

[Survived] StringLiteral
Desktop/Web Engineering/scripts/checkInput.js:20:15
     }
     if (height < 140 || height > 300) {
         wrongInput = true
-        throw "Bitte geben Sie eine Größe zwischen 140cm und 300cm ein"
+        throw ""
     }
 

[Survived] BlockStatement
Desktop/Web Engineering/scripts/checkInput.js:23:10
         throw "Bitte geben Sie eine Größe zwischen 140cm und 300cm ein"
     }
 
-    else {
-        wrongInput = false
-    }
+    else {}
 
 }

[Survived] BooleanLiteral
Desktop/Web Engineering/scripts/checkInput.js:24:22
     }
 
     else {
-        wrongInput = false
+        wrongInput = true
     }
 

[Survived] BlockStatement
Desktop/Web Engineering/scripts/checkInput.js:32:13
 
 
 
-if (module) {
-    module.exports = {
-        checkInput
-    }
-}
+if (module) {}
 
 if (window) {

[Survived] ConditionalExpression
Desktop/Web Engineering/scripts/checkInput.js:32:5
 
 
 
-if (module) {
+if (true) {
     module.exports = {
         checkInput

[Killed] BlockStatement
Desktop/Web Engineering/scripts/checkInput.js:38:13
     }
 }
 
-if (window) {
-    window.checkInput = checkInput
-}
+if (window) {}
 

[Killed] ConditionalExpression
Desktop/Web Engineering/scripts/checkInput.js:38:5
     }
 }
 
-if (window) {
+if (false) {
     window.checkInput = checkInput
 }
