[Killed] BlockStatement
Desktop/Web Engineering/scripts/checkInputWater.js:3:40
 let wrongInput = new Boolean(false)
 
-function checkInputWater (weight, age) {
-
-
-    if (!weight || !age) {
-        wrongInput = true
-        throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"
-    }
-    if (weight < 35 || weight > 999) {
-        wrongInput = true
-        throw "Bitte geben Sie ein Gewicht zwischen 35kg und 999kg ein"
-    }
-    if (age < 16 || age > 99) {
-        wrongInput = true
-        throw "Bitte geben Sie ein Alter zwischen 16 und 99 Jahren ein"
-    }
-
-    else {
-        wrongInput = false
-    }
-
-}
+function checkInputWater (weight, age) {}
 
 

[Killed] BooleanLiteral
Desktop/Web Engineering/scripts/checkInputWater.js:6:20
 function checkInputWater (weight, age) {
 
 
-    if (!weight || !age) {
+    if (!weight || age) {
         wrongInput = true
         throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"

[Killed] ConditionalExpression
Desktop/Web Engineering/scripts/checkInputWater.js:6:9
 function checkInputWater (weight, age) {
 
 
-    if (!weight || !age) {
+    if (true) {
         wrongInput = true
         throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"

[Survived] BooleanLiteral
Desktop/Web Engineering/scripts/checkInputWater.js:7:22
 
 
     if (!weight || !age) {
-        wrongInput = true
+        wrongInput = false
         throw "Sie haben nicht alle erforderlichen Felder ausgefüllt"
     }

[Survived] StringLiteral
Desktop/Web Engineering/scripts/checkInputWater.js:12:15
     }
     if (weight < 35 || weight > 999) {
         wrongInput = true
-        throw "Bitte geben Sie ein Gewicht zwischen 35kg und 999kg ein"
+        throw ""
     }
     if (age < 16 || age > 99) {

[Killed] ConditionalExpression
Desktop/Web Engineering/scripts/checkInputWater.js:14:9
         wrongInput = true
         throw "Bitte geben Sie ein Gewicht zwischen 35kg und 999kg ein"
     }
-    if (age < 16 || age > 99) {
+    if (false) {
         wrongInput = true
         throw "Bitte geben Sie ein Alter zwischen 16 und 99 Jahren ein"

[Survived] BlockStatement
Desktop/Web Engineering/scripts/checkInputWater.js:28:13
 
 
 
-if (module) {
-    module.exports = {
-        checkInputWater
-    }
-}
+if (module) {}
 
 if (window) {

[Survived] ObjectLiteral
Desktop/Web Engineering/scripts/checkInputWater.js:29:22
 
 
 if (module) {
-    module.exports = {
-        checkInputWater
-    }
+    module.exports = {}
 }
 

[Killed] BlockStatement
Desktop/Web Engineering/scripts/checkInputWater.js:34:13
     }
 }
 
-if (window) {
-    window.checkInputWater = checkInputWater
-}
+if (window) {}
 
