[Killed] BlockStatement
Desktop/Web Engineering/scripts/getPal.js:1:28
-function getPal(palString) {
-    const palValues = {
-        "liegend": 1.2,
-        "sitzend": 1.45,
-        "stehend": 1.65,
-        "gehend": 1.85,
-        "aktiv": 2.2
-    }
-
-    const pal = palValues[palString]
-    return pal
-}
+function getPal(palString) {}
 
 

[Survived] BlockStatement
Desktop/Web Engineering/scripts/getPal.js:17:13
 
 
 
-if (module) {
-    module.exports = {
-        getPal
-    }
-}
+if (module) {}
 
 if (window) {

[Killed] BlockStatement
Desktop/Web Engineering/scripts/getPal.js:23:13
     }
 }
 
-if (window) {
-    window.getPal = getPal
-}
+if (window) {}
