[Survived] BlockStatement
Desktop/Web Engineering/scripts/handleImage.js:1:42
-  function handleImage(activity, gender) {
-    const image = "assets/" + activity.options[activity.selectedIndex].value + "_" + gender + ".png"
-    document.getElementById("person").src = image;
-  }
+  function handleImage(activity, gender) {}
 
 

[Survived] ArithmeticOperator
Desktop/Web Engineering/scripts/handleImage.js:2:19
   function handleImage(activity, gender) {
-    const image = "assets/" + activity.options[activity.selectedIndex].value + "_" + gender + ".png"
+    const image = "assets/" + activity.options[activity.selectedIndex].value + "_" + gender - ".png"
     document.getElementById("person").src = image;
   }

[Survived] ArithmeticOperator
Desktop/Web Engineering/scripts/handleImage.js:2:19
   function handleImage(activity, gender) {
-    const image = "assets/" + activity.options[activity.selectedIndex].value + "_" + gender + ".png"
+    const image = "assets/" + activity.options[activity.selectedIndex].value - "_" + gender + ".png"
     document.getElementById("person").src = image;
   }
