[Killed] BlockStatement
Desktop/Web Engineering/scripts/harris.js:1:51
-function harris(weight, height, age, pal, gender) {
-    let result
-    let palresult
-
-    if (gender == "male") {
-        checkInput(weight,height,age)
-        result = Math.round(66.5 + (13.7 * weight) + (5 * height) - (6.8 * age))
-        palresult = Math.round(result * getPal(pal))
-    }
-    else {
-        checkInput(weight,height,age)
-        result = Math.round(655.1 + (9.6 * weight) + (1.8 * height) - (4.7 * age))
-        palresult = Math.round(result * getPal(pal))
-    }
-
-    return {
-        grundumsatz: result,
-        leistungsumsatz: palresult
-    }
-}
+function harris(weight, height, age, pal, gender) {}
 
 

[Killed] EqualityOperator
Desktop/Web Engineering/scripts/harris.js:5:9
     let result
     let palresult
 
-    if (gender == "male") {
+    if (gender != "male") {
         checkInput(weight,height,age)
         result = Math.round(66.5 + (13.7 * weight) + (5 * height) - (6.8 * age))

[Killed] BlockStatement
Desktop/Web Engineering/scripts/harris.js:5:27
     let result
     let palresult
 
-    if (gender == "male") {
-        checkInput(weight,height,age)
-        result = Math.round(66.5 + (13.7 * weight) + (5 * height) - (6.8 * age))
-        palresult = Math.round(result * getPal(pal))
-    }
+    if (gender == "male") {}
     else {
         checkInput(weight,height,age)

[Killed] ArithmeticOperator
Desktop/Web Engineering/scripts/harris.js:7:70
 
     if (gender == "male") {
         checkInput(weight,height,age)
-        result = Math.round(66.5 + (13.7 * weight) + (5 * height) - (6.8 * age))
+        result = Math.round(66.5 + (13.7 * weight) + (5 * height) - (6.8 / age))
         palresult = Math.round(result * getPal(pal))
     }

[Killed] ArithmeticOperator
Desktop/Web Engineering/scripts/harris.js:7:37
 
     if (gender == "male") {
         checkInput(weight,height,age)
-        result = Math.round(66.5 + (13.7 * weight) + (5 * height) - (6.8 * age))
+        result = Math.round(66.5 + (13.7 / weight) + (5 * height) - (6.8 * age))
         palresult = Math.round(result * getPal(pal))
     }

[Killed] ArithmeticOperator
Desktop/Web Engineering/scripts/harris.js:8:32
     if (gender == "male") {
         checkInput(weight,height,age)
         result = Math.round(66.5 + (13.7 * weight) + (5 * height) - (6.8 * age))
-        palresult = Math.round(result * getPal(pal))
+        palresult = Math.round(result / getPal(pal))
     }
     else {

[Killed] BlockStatement
Desktop/Web Engineering/scripts/harris.js:10:10
         result = Math.round(66.5 + (13.7 * weight) + (5 * height) - (6.8 * age))
         palresult = Math.round(result * getPal(pal))
     }
-    else {
-        checkInput(weight,height,age)
-        result = Math.round(655.1 + (9.6 * weight) + (1.8 * height) - (4.7 * age))
-        palresult = Math.round(result * getPal(pal))
-    }
+    else {}
 
     return {

[Killed] ArithmeticOperator
Desktop/Web Engineering/scripts/harris.js:12:72
     }
     else {
         checkInput(weight,height,age)
-        result = Math.round(655.1 + (9.6 * weight) + (1.8 * height) - (4.7 * age))
+        result = Math.round(655.1 + (9.6 * weight) + (1.8 * height) - (4.7 / age))
         palresult = Math.round(result * getPal(pal))
     }

[Killed] ArithmeticOperator
Desktop/Web Engineering/scripts/harris.js:12:29
     }
     else {
         checkInput(weight,height,age)
-        result = Math.round(655.1 + (9.6 * weight) + (1.8 * height) - (4.7 * age))
+        result = Math.round(655.1 + 9.6 * weight + 1.8 * height + 4.7 * age)
         palresult = Math.round(result * getPal(pal))
     }

[Killed] ArithmeticOperator
Desktop/Web Engineering/scripts/harris.js:13:32
     else {
         checkInput(weight,height,age)
         result = Math.round(655.1 + (9.6 * weight) + (1.8 * height) - (4.7 * age))
-        palresult = Math.round(result * getPal(pal))
+        palresult = Math.round(result / getPal(pal))
     }
 

[Killed] ConditionalExpression
Desktop/Web Engineering/scripts/harris.js:24:5
 
 
 
-if (module) {
+if (false) {
     module.exports = {
         harris

[Killed] BlockStatement
Desktop/Web Engineering/scripts/harris.js:24:13
 
 
 
-if (module) {
-    module.exports = {
-        harris
-    }
-}
+if (module) {}
 
 if (window) {

[Survived] BlockStatement
Desktop/Web Engineering/scripts/harris.js:30:13
     }
 }
 
-if (window) {
-    window.harris = harris
-}
+if (window) {}

[Survived] ConditionalExpression
Desktop/Web Engineering/scripts/harris.js:30:5
     }
 }
 
-if (window) {
+if (true) {
     window.harris = harris
 }
