[Survived] BlockStatement
Desktop/Web Engineering/scripts/inputOhneE.js:10:39
 ];
 
 
-function disableInvalidKeys(inputBox) {
-    inputBox.addEventListener("keydown", function (e) {
-        if (invalidChars.includes(e.key)) {
-            e.preventDefault();
-        }
-    });
-}
+function disableInvalidKeys(inputBox) {}
 
 if (document.getElementById("gewicht") != null) {

[Survived] BlockStatement
Desktop/Web Engineering/scripts/inputOhneE.js:11:55
 
 
 function disableInvalidKeys(inputBox) {
-    inputBox.addEventListener("keydown", function (e) {
-        if (invalidChars.includes(e.key)) {
-            e.preventDefault();
-        }
-    });
+    inputBox.addEventListener("keydown", function (e) {});
 }
 

[Survived] BlockStatement
Desktop/Web Engineering/scripts/inputOhneE.js:12:43
 
 function disableInvalidKeys(inputBox) {
     inputBox.addEventListener("keydown", function (e) {
-        if (invalidChars.includes(e.key)) {
-            e.preventDefault();
-        }
+        if (invalidChars.includes(e.key)) {}
     });
 }

[Survived] ConditionalExpression
Desktop/Web Engineering/scripts/inputOhneE.js:12:13
 
 function disableInvalidKeys(inputBox) {
     inputBox.addEventListener("keydown", function (e) {
-        if (invalidChars.includes(e.key)) {
+        if (false) {
             e.preventDefault();
         }

[Survived] EqualityOperator
Desktop/Web Engineering/scripts/inputOhneE.js:18:5
     });
 }
 
-if (document.getElementById("gewicht") != null) {
+if (document.getElementById("gewicht") == null) {
 disableInvalidKeys(document.getElementById("gewicht"))
 }

[Survived] ConditionalExpression
Desktop/Web Engineering/scripts/inputOhneE.js:18:5
     });
 }
 
-if (document.getElementById("gewicht") != null) {
+if (false) {
 disableInvalidKeys(document.getElementById("gewicht"))
 }

[Survived] BlockStatement
Desktop/Web Engineering/scripts/inputOhneE.js:22:47
 disableInvalidKeys(document.getElementById("gewicht"))
 }
 
-if (document.getElementById("alter") != null) {
-disableInvalidKeys(document.getElementById("alter"))
-}
+if (document.getElementById("alter") != null) {}
 
 if (document.getElementById("groesse") != null) {

[Survived] ConditionalExpression
Desktop/Web Engineering/scripts/inputOhneE.js:22:5
 disableInvalidKeys(document.getElementById("gewicht"))
 }
 
-if (document.getElementById("alter") != null) {
+if (false) {
 disableInvalidKeys(document.getElementById("alter"))
 }

[Survived] ConditionalExpression
Desktop/Web Engineering/scripts/inputOhneE.js:26:5
 disableInvalidKeys(document.getElementById("alter"))
 }
 
-if (document.getElementById("groesse") != null) {
+if (true) {
 disableInvalidKeys(document.getElementById("groesse"))
 }

[Survived] ConditionalExpression
Desktop/Web Engineering/scripts/inputOhneE.js:26:5
 disableInvalidKeys(document.getElementById("alter"))
 }
 
-if (document.getElementById("groesse") != null) {
+if (false) {
 disableInvalidKeys(document.getElementById("groesse"))
 }

[Survived] StringLiteral
Desktop/Web Engineering/scripts/inputOhneE.js:27:44
 }
 
 if (document.getElementById("groesse") != null) {
-disableInvalidKeys(document.getElementById("groesse"))
+disableInvalidKeys(document.getElementById(""))
 }
 
