[Survived] BlockStatement
Desktop/Web Engineering/scripts/printError.js:2:30
 /* istanbul ignore file */
-function printError(warning) {
-    // this.warning = warning;
-    // this.name = "Error";
-    document.getElementById("fehler").innerHTML = warning;
-}
+function printError(warning) {}
 
 if (module) {

[Survived] BlockStatement
Desktop/Web Engineering/scripts/printError.js:8:13
     document.getElementById("fehler").innerHTML = warning;
 }
 
-if (module) {
-    module.exports = {
-        printError
-    }
-}
+if (module) {}
 
 if (window) {

[Survived] BlockStatement
Desktop/Web Engineering/scripts/printError.js:14:13
     }
 }
 
-if (window) {
-    window.printError = printError
-}
+if (window) {}
