[Survived] StringLiteral
Desktop/Web Engineering/scripts/resetValues.js:1:38
-let button = document.getElementById("zuruecksetzen")
+let button = document.getElementById("")
 
 button.addEventListener("click", function () {

[Survived] BlockStatement
Desktop/Web Engineering/scripts/resetValues.js:3:46
 let button = document.getElementById("zuruecksetzen")
 
-button.addEventListener("click", function () {
-    document.getElementById("grundumsatz").innerHTML = ""
-    document.getElementById("leistungsumsatz").innerHTML = ""
-    const imageReset = "assets/liegend_male.png"
-    document.getElementById("person").src = imageReset
-})
+button.addEventListener("click", function () {})

[Survived] StringLiteral
Desktop/Web Engineering/scripts/resetValues.js:4:56
 let button = document.getElementById("zuruecksetzen")
 
 button.addEventListener("click", function () {
-    document.getElementById("grundumsatz").innerHTML = ""
+    document.getElementById("grundumsatz").innerHTML = "Stryker was here!"
     document.getElementById("leistungsumsatz").innerHTML = ""
     const imageReset = "assets/liegend_male.png"

[Survived] StringLiteral
Desktop/Web Engineering/scripts/resetValues.js:5:29
 
 button.addEventListener("click", function () {
     document.getElementById("grundumsatz").innerHTML = ""
-    document.getElementById("leistungsumsatz").innerHTML = ""
+    document.getElementById("").innerHTML = ""
     const imageReset = "assets/liegend_male.png"
     document.getElementById("person").src = imageReset

[Survived] StringLiteral
Desktop/Web Engineering/scripts/resetValues.js:7:29
     document.getElementById("grundumsatz").innerHTML = ""
     document.getElementById("leistungsumsatz").innerHTML = ""
     const imageReset = "assets/liegend_male.png"
-    document.getElementById("person").src = imageReset
+    document.getElementById("").src = imageReset
 })
