[Survived] BlockStatement
Desktop/Web Engineering/scripts/resetValuesWater.js:3:46
 let button = document.getElementById("zuruecksetzen")
 
-button.addEventListener("click", function () {
-    document.getElementById("wasserbedarf").innerHTML = ""
-})
+button.addEventListener("click", function () {})

[Survived] StringLiteral
Desktop/Web Engineering/scripts/resetValuesWater.js:3:25
 let button = document.getElementById("zuruecksetzen")
 
-button.addEventListener("click", function () {
+button.addEventListener("", function () {
     document.getElementById("wasserbedarf").innerHTML = ""
 })
