[Survived] StringLiteral
Desktop/Web Engineering/scripts/watercalc.js:4:35
 window.onload = () => {
 }
 
-let sel = document.getElementById("werte")
+let sel = document.getElementById("")
 sel.addEventListener("input", function () {
 

[Survived] BlockStatement
Desktop/Web Engineering/scripts/watercalc.js:13:9
     const age = document.getElementById("alter").value
 
     let result = {}
-    try {
-        result = waterformular(weight, age)
-    } catch (err) {
+    try {} catch (err) {
         printError(err)
     }

[Survived] BlockStatement
Desktop/Web Engineering/scripts/watercalc.js:15:19
     let result = {}
     try {
         result = waterformular(weight, age)
-    } catch (err) {
-        printError(err)
-    }
+    } catch (err) {}
 
     //function printError(warning) {

[Survived] EqualityOperator
Desktop/Web Engineering/scripts/watercalc.js:45:9
         
     } */
 
-    if (wrongInput == false) {
+    if (wrongInput != false) {
         printError("")
         document.getElementById("wasserbedarf").innerHTML = result + " ml pro Tag"

[Survived] ArithmeticOperator
Desktop/Web Engineering/scripts/watercalc.js:47:61
 
     if (wrongInput == false) {
         printError("")
-        document.getElementById("wasserbedarf").innerHTML = result + " ml pro Tag"
+        document.getElementById("wasserbedarf").innerHTML = result - " ml pro Tag"
     }
 

[Survived] StringLiteral
Desktop/Web Engineering/scripts/watercalc.js:47:70
 
     if (wrongInput == false) {
         printError("")
-        document.getElementById("wasserbedarf").innerHTML = result + " ml pro Tag"
+        document.getElementById("wasserbedarf").innerHTML = result + ""
     }
 
