[Killed] BlockStatement
Desktop/Web Engineering/scripts/waterformular.js:1:37
-function waterformular(weight, age) {
-
-    let result
-    if (age < 64) {
-        checkInputWater(weight, age)
-        result = Math.round(weight * 35)
-    }
-    
-    else {
-        checkInputWater(weight, age)
-        result = Math.round(weight * 30)
-    }
-
-    return result
-    // return {
-    //     wasserbedarf: result
-    // }
-}
+function waterformular(weight, age) {}
 
 

[Killed] ConditionalExpression
Desktop/Web Engineering/scripts/waterformular.js:4:9
 function waterformular(weight, age) {
 
     let result
-    if (age < 64) {
+    if (false) {
         checkInputWater(weight, age)
         result = Math.round(weight * 35)

[Killed] BlockStatement
Desktop/Web Engineering/scripts/waterformular.js:4:19
 function waterformular(weight, age) {
 
     let result
-    if (age < 64) {
-        checkInputWater(weight, age)
-        result = Math.round(weight * 35)
-    }
+    if (age < 64) {}
     
     else {

[Killed] ArithmeticOperator
Desktop/Web Engineering/scripts/waterformular.js:6:29
     let result
     if (age < 64) {
         checkInputWater(weight, age)
-        result = Math.round(weight * 35)
+        result = Math.round(weight / 35)
     }
     

[Killed] BlockStatement
Desktop/Web Engineering/scripts/waterformular.js:9:10
         result = Math.round(weight * 35)
     }
     
-    else {
-        checkInputWater(weight, age)
-        result = Math.round(weight * 30)
-    }
+    else {}
 
     return result

[Survived] ArithmeticOperator
Desktop/Web Engineering/scripts/waterformular.js:11:29
     
     else {
         checkInputWater(weight, age)
-        result = Math.round(weight * 30)
+        result = Math.round(weight / 30)
     }
 

[Killed] BlockStatement
Desktop/Web Engineering/scripts/waterformular.js:22:12
 
 
 
-if (module){
-    module.exports = {
-        waterformular
-    }
-}
+if (module){}
 
 if (window){
